responseTemplates/CustAcc.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gbo="urn:imb:gbo:v2">
  <soapenv:Header>
    <gbo:UCBRUHeaders xmlns:gbo="urn:imb:gbo:v2">
      <gbo:Audit>
        <gbo:MessagePath>
          <gbo:Step>
            <gbo:Application.Module>SACC.Adp.SRVACC.v2.AcliQu.RequestHandler</gbo:Application.Module>
            <gbo:VersionId>v2</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.415+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>START</gbo:RoutingRole>
            <gbo:Comment>Start of message processing</gbo:Comment>
          </gbo:Step>
          <gbo:Step>
            <gbo:Application.Module>SACC.AccountListQuery.RequestHandler</gbo:Application.Module>
            <gbo:VersionId>v5</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.426+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>START</gbo:RoutingRole>
            <gbo:Comment>Start of message processing</gbo:Comment>
          </gbo:Step>
          <gbo:Step>
            <gbo:Application.Module>SACC.MasterAccountPositioningBatchQuery.RequestHandler</gbo:Application.Module>
            <gbo:VersionId>v5</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.433+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>START</gbo:RoutingRole>
            <gbo:Comment>Start of message processing</gbo:Comment>
          </gbo:Step>
          <gbo:Step>
            <gbo:Application.Module>SACC.MasterAccountPositioningBatchQuery.RequestHandler</gbo:Application.Module>
            <gbo:VersionId>v5</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.591+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>ROUTE</gbo:RoutingRole>
            <gbo:Comment>All accounts received from the cache</gbo:Comment>
          </gbo:Step>
          <gbo:Step>
            <gbo:Application.Module>SACC.MasterAccountPositioningBatchQuery.ResponseHandler</gbo:Application.Module>
            <gbo:VersionId>v5</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.599+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
            <gbo:Comment>Finish of message processing</gbo:Comment>
          </gbo:Step>
          <gbo:Step>
            <gbo:Application.Module>SACC.AccountListQuery.ABSRouter</gbo:Application.Module>
            <gbo:VersionId>v5</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.605+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>ROUTE</gbo:RoutingRole>
            <gbo:Comment>Routing by cache settings</gbo:Comment>
          </gbo:Step>
          <gbo:Step>
            <gbo:Application.Module>SACC.AccountListQuery.ResponseHandler</gbo:Application.Module>
            <gbo:VersionId>5</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.683+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>ROUTE SUCCESS</gbo:RoutingRole>
            <gbo:Comment>The responses received from ECHO,FCC</gbo:Comment>
          </gbo:Step>
          <gbo:Step>
            <gbo:Application.Module>SACC.AccountListQuery.ResponseHandler</gbo:Application.Module>
            <gbo:VersionId>v5</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.685+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
            <gbo:Comment>Finish of message processing</gbo:Comment>
          </gbo:Step>
          <gbo:Step>
            <gbo:Application.Module>SACC.Adp.SRVACC.v2.AcliQu.ResponseHandler</gbo:Application.Module>
            <gbo:VersionId>v2</gbo:VersionId>
            <gbo:TimeStamp>2023-12-07T15:27:45.890+03:00</gbo:TimeStamp>
            <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
            <gbo:Comment>Finish of message processing</gbo:Comment>
          </gbo:Step>
        </gbo:MessagePath>
      </gbo:Audit>
    </gbo:UCBRUHeaders>
  </soapenv:Header>
  <soapenv:Body>
    <gbo:AccountList>
      <gbo:AccountDetails>
        <gbo:AccountNo>00900136RURPRBAS01</gbo:AccountNo>
        <gbo:Branch>A02</gbo:Branch>
        <gbo:CBAccountNo>40817810150010538589</gbo:CBAccountNo>
        <gbo:Ccy>RUR</gbo:Ccy>
        <gbo:CcyDigital>810</gbo:CcyDigital>
        <gbo:Status>O</gbo:Status>
        <gbo:CustomerNo>00900136</gbo:CustomerNo>
        <gbo:Special>PRBAS</gbo:Special>
        <gbo:OpenDate>2014-10-21</gbo:OpenDate>
        <gbo:AltAccountNo>00900136RURPRBAS01</gbo:AltAccountNo>
        <gbo:Type>S</gbo:Type>
        <gbo:IsDormant>N</gbo:IsDormant>
        <gbo:PostAllowed>N</gbo:PostAllowed>
        <gbo:CreditTransAllowed>Y</gbo:CreditTransAllowed>
        <gbo:DebitTransAllowed>Y</gbo:DebitTransAllowed>
        <gbo:ClearingBank>044525545</gbo:ClearingBank>
        <gbo:CorBank>044525545</gbo:CorBank>
        <gbo:Positioning>
          <gbo:CBAccount>40817810150010538589</gbo:CBAccount>
          <gbo:IMBAccountNo>40817810150010538589</gbo:IMBAccountNo>
          <gbo:IMBBranch>A02</gbo:IMBBranch>
          <gbo:HostABSAccountNo>00900136RURPRBAS01</gbo:HostABSAccountNo>
          <gbo:HostABSBranch>A02</gbo:HostABSBranch>
          <gbo:HostABS>FCC</gbo:HostABS>
        </gbo:Positioning>
        <gbo:MIS>
          <gbo:GroupComponent>R_S_MC</gbo:GroupComponent>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS1</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS2</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS3</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS4</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS5</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS6</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS7</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS8</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS9</gbo:Name>
          </gbo:TransactionClass>
          <gbo:TransactionClass>
            <gbo:Name>TXNMIS10</gbo:Name>
          </gbo:TransactionClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS1</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS2</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS3</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS4</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS5</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS6</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS7</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS8</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS9</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CompositeClass>
            <gbo:Name>COMPMIS10</gbo:Name>
          </gbo:CompositeClass>
          <gbo:CostCode>
            <gbo:Name>COSTCOD1</gbo:Name>
          </gbo:CostCode>
          <gbo:CostCode>
            <gbo:Name>COSTCOD2</gbo:Name>
          </gbo:CostCode>
          <gbo:CostCode>
            <gbo:Name>COSTCOD3</gbo:Name>
          </gbo:CostCode>
          <gbo:CostCode>
            <gbo:Name>COSTCOD4</gbo:Name>
          </gbo:CostCode>
          <gbo:CostCode>
            <gbo:Name>COSTCOD5</gbo:Name>
          </gbo:CostCode>
        </gbo:MIS>
        <gbo:UDF>
          <gbo:Name>CusSegment</gbo:Name>
          <gbo:Value>TIER_I</gbo:Value>
        </gbo:UDF>
        <gbo:UDF>
          <gbo:Name>ParentBranchName</gbo:Name>
          <gbo:Value>UCB, Moscow</gbo:Value>
        </gbo:UDF>
      </gbo:AccountDetails>
    </gbo:AccountList>
  </soapenv:Body>
</soapenv:Envelope>